---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.SetValue(System.Double)
source: html/c510b2ca-b22d-789f-b329-58efd5713da0.htm
---
# Autodesk.Revit.DB.ScheduleFilter.SetValue Method

Set the filter value to a double.

## Syntax (C#)
```csharp
public void SetValue(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The filter value.